-- my note book

-- DDL
    -- 테이블 생성
        -- 조건명시
    
    -- 테이블 삭제
    
    -- 테이블 수정
        -- 컬럼 삭제
        -- 컬럼 수정
        -- 컬럼 추가
        
    -- 테이블 이름 변경

    -- truncate에 대해 알아보기 
    
    -- 데이터 무결성을 위한 제약조건 5가지
    
    
-- DML


-- DCL


-- 트랜잭션

-- 가상테이블


-- 시퀀스  
    -- sequence?   
    -- create sequence
    -- drop sequence
    -- 시퀀스의 현재 값과 다음 값 

-- 인덱스
    -- index ?  
    -- create index ?
    -- drop index ?
    
--  데이터베이스 프로그래밍
    -- 개념? 
    -- PL/SQL
        -- 프로시저
            -- 프로시저란?            
            -- 프로시저 정의(생성)            
            -- 프로시저 호출            
            -- 제어문을 사용하는 프로시저
                -- 제어문 종류와 사용법        
            -- 결과 반환 프로시져             
            -- 커서를 사용하는 프로시저
                -- 커서생성        
        -- 트리거
            -- 트리거란?           
        -- 사용자 정의 함수
        -- PL/SQL문법
    
    